--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  F:\fjx学习\计量\stata入门\logfile\test.log
  log type:  text
 opened on:  18 Apr 2022, 01:57:10

. cd "F:\fjx学习\计量" 
F:\fjx学习\计量

. shell out RESTAT_Olympic_Data.xlsx

. import excel "RESTAT_Olympic_Data", sheet("Sheet2") firstrow clear 
(15 vars, 1,610 obs)

. reg medaltot gdp pop host planned perform

      Source |       SS           df       MS      Number of obs   =     1,254
-------------+----------------------------------   F(5, 1248)      =    722.68
       Model |   243614.62         5   48722.924   Prob > F        =    0.0000
    Residual |  84140.3338     1,248  67.4201392   R-squared       =    0.7433
-------------+----------------------------------   Adj R-squared   =    0.7423
       Total |  327754.954     1,253   261.57618   Root MSE        =     8.211

------------------------------------------------------------------------------
    medaltot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         gdp |   2.29e-12   5.98e-13     3.83   0.000     1.12e-12    3.46e-12
         pop |   1.64e-08   2.72e-09     6.04   0.000     1.11e-08    2.18e-08
        host |   23.81755   2.713314     8.78   0.000     18.49439    29.14071
     planned |   4.210374   1.941632     2.17   0.030     .4011513    8.019596
     perform |   1.017472   .0276193    36.84   0.000     .9632862    1.071657
       _cons |   .6286026   .2477198     2.54   0.011     .1426093    1.114596
------------------------------------------------------------------------------

. shell out RESTAT_Olympic_Data.xlsx

. import excel "RESTAT_Olympic_Data", sheet("Sheet3") firstrow clear 
(21 vars, 12,810 obs)

. gen pre=_b[gdp]*gdp+_b[pop]*pop+_b[host]*host+_b[planned]*planned+_b[_cons]+_b
> [perform]*perform
(12,789 missing values generated)

. tab pre

        pre |      Freq.     Percent        Cum.
------------+-----------------------------------
    1.37602 |          1        4.76        4.76
   3.139067 |          1        4.76        9.52
   3.364494 |          1        4.76       14.29
   4.246481 |          1        4.76       19.05
   4.248528 |          1        4.76       23.81
   10.89905 |          1        4.76       28.57
   13.20977 |          1        4.76       33.33
   15.47011 |          1        4.76       38.10
   18.70078 |          1        4.76       42.86
    21.2891 |          1        4.76       47.62
   21.63279 |          1        4.76       52.38
   23.16414 |          1        4.76       57.14
   23.46731 |          1        4.76       61.90
   25.12041 |          1        4.76       66.67
   25.63965 |          1        4.76       71.43
   27.07585 |          1        4.76       76.19
   35.24834 |          1        4.76       80.95
   45.06207 |          1        4.76       85.71
   81.21175 |          1        4.76       90.48
   92.66252 |          1        4.76       95.24
    123.662 |          1        4.76      100.00
------------+-----------------------------------
      Total |         21      100.00

. save "F:\fjx学习\计量\stata入门\datafile\奖牌预测.dta"
file F:\fjx学习\计量\stata入门\datafile\奖牌预测.dta saved

. 
end of do-file

. exit, clear
